package oop;
	/*
	 * OOP : Object Oriented Programming
	 * - 객체 지향 프로그래밍
	 * - 객체를 정의하고 이 객체들 간에 상호작용을 통해서 코드를 작성하는 기법
	 * 
	 * 객체 (Object)		: 현실의 모든 데이터
	 * 클래스 (Class)		: 객체를 컴퓨터 코드로 표현한 상태 (= 도면)
	 * 인스턴스 (Instance)	: 클래스를 컴퓨터 메모리에 생성한 상태 (= 실체)
	 * 
	 * 클래스 작성법)
	 * class 클래스명{
	 * 	1. 필드 (field)		: 멤버 변수, 객체의 속성을 표현
	 * 	2. 메서드 (method)		: 멤버 함수, 객체의 기능을 구현
	 * 
	 * 인스턴스 생성법)
	 * - new 라는 키워드로 생성가능
	 * - 생성된 인스턴스는 참조 변수에 저장해야 재사용 가능
	 * 
	 * 클래스명 변수 = new 클래스명();
	 */
public class Ex01 {

}
